In [22]:
import numpy as np
import pandas as pd

In [16]:
from numpy.random import randn

In [3]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]

In [4]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [8]:
tuples_array=list(zip(outside,inside))

In [9]:
tuples_array

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [10]:
index_1=pd.MultiIndex.from_tuples(tuples_array)

In [11]:
index_1

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [12]:
df=pd.DataFrame(randn(6,2),index_1,['A','B'])

In [13]:
df

             A         B
G1 1 -0.774179  0.031605
   2 -0.568211 -0.899809
   3 -0.472710  0.169503
G2 1 -0.455305  1.942658
   2 -0.594529 -1.344362
   3  1.191093  0.655940

In [3]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [4]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [5]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [6]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [8]:
df2.merge(df1, left_on='rkey', right_on='lkey')

  rkey  value_x lkey  value_y
0  foo        5  foo        1
1  foo        5  foo        5
2  foo        8  foo        1
3  foo        8  foo        5
4  bar        6  bar        2
5  baz        7  baz        3

In [20]:
df_m1=pd.DataFrame({'HPI':[80,85,88,85],
     'Int_rate': [2,3,2,2],
     'US_GDP_thousands':[50,55,65,55]},
      [2001,2002,2003,2004])

In [21]:
df_m1

      HPI  Int_rate  US_GDP_thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   85         2                55

In [22]:
df_m2=pd.DataFrame({'HPI':[80,85,88,85],
     'Int_rate': [2,3,2,2],
     'US_GDP_thousands':[50,55,65,55]},
      [2005,2006,2007,2008])

In [23]:
df_m2

      HPI  Int_rate  US_GDP_thousands
2005   80         2                50
2006   85         3                55
2007   88         2                65
2008   85         2                55

In [24]:
df_m3=pd.DataFrame({'HPI':[80,85,88,85],
     'Unemployment': [7,8,9,6],
     'Low_tier_HPI':[50,52,50,53]},
      [2001,2002,2003,2004])

In [25]:
df_m3

      HPI  Unemployment  Low_tier_HPI
2001   80             7            50
2002   85             8            52
2003   88             9            50
2004   85             6            53

In [28]:
pd.merge(df_m1,df_m3, on=['HPI'])

   HPI  Int_rate  US_GDP_thousands  Unemployment  Low_tier_HPI
0   80         2                50             7            50
1   85         3                55             8            52
2   85         3                55             6            53
3   85         2                55             8            52
4   85         2                55             6            53
5   88         2                65             9            50

In [29]:
pd.merge(df_m1,df_m2, on=['HPI','Int_rate'])

   HPI  Int_rate  US_GDP_thousands_x  US_GDP_thousands_y
0   80         2                  50                  50
1   85         3                  55                  55
2   88         2                  65                  65
3   85         2                  55                  55

In [30]:
df_m1.set_index("HPI",inplace=True)

In [31]:
df_m3.set_index("HPI",inplace=True)

In [33]:
df_m3

     Unemployment  Low_tier_HPI
HPI
80              7            50
85              8            52
88              9            50
85              6            53

In [34]:
join_matrix=df_m1.join(df_m3)

In [35]:
join_matrix

     Int_rate  US_GDP_thousands  Unemployment  Low_tier_HPI
HPI
80          2                50             7            50
85          3                55             8            52
85          3                55             6            53
85          2                55             8            52
85          2                55             6            53
88          2                65             9            50

In [36]:
df_m3.join(df_m1)

     Unemployment  Low_tier_HPI  Int_rate  US_GDP_thousands
HPI
80              7            50         2                50
85              8            52         3                55
85              8            52         2                55
85              6            53         3                55
85              6            53         2                55
88              9            50         2                65

In [37]:
type(df_m3.join(df_m1))

pandas.core.frame.DataFrame

In [38]:
check1=pd.DataFrame({'Year':[2001,2002,2003,2004],
     'Int_rate': [2,3,2,2],
     'US_GDP_thousands':[50,55,65,55]})

In [40]:
check1.set_index('Year',inplace=True)

In [41]:
check1

      Int_rate  US_GDP_thousands
Year
2001         2                50
2002         3                55
2003         2                65
2004         2                55

In [42]:
check2=pd.DataFrame({'Year':[2001,2002,2004,2005],
     'Int_rate': [2,3,2,2],
     'US_GDP_thousands':[50,55,65,55]})

In [43]:
check2.set_index('Year',inplace=True)

In [44]:
check2

      Int_rate  US_GDP_thousands
Year
2001         2                50
2002         3                55
2004         2                65
2005         2                55

In [47]:
merge_check=pd.merge(check1,check2,on='Year',how='left')     #check1 is on left side AND check2 on right side and merging take place from left DataFrame

In [48]:
merge_check

      Int_rate_x  US_GDP_thousands_x  Int_rate_y  US_GDP_thousands_y
Year
2001           2                  50         2.0                50.0
2002           3                  55         3.0                55.0
2003           2                  65         NaN                 NaN
2004           2                  55         2.0                65.0

<h3>Here, you can see, merging operation taking place from left DataFrame to right Dataframe on key "Year" which is used as index and common in both; "how" can be "left,right,inner,outer"</h3>

In [49]:
pd.merge(check2,check1, on='Year',how='left')

      Int_rate_x  US_GDP_thousands_x  Int_rate_y  US_GDP_thousands_y
Year
2001           2                  50         2.0                50.0
2002           3                  55         3.0                55.0
2004           2                  65         2.0                55.0
2005           2                  55         NaN                 NaN

In [51]:
pd.merge(check2,check1, on='Year',how='inner')    #common in both ; inner merge

      Int_rate_x  US_GDP_thousands_x  Int_rate_y  US_GDP_thousands_y
Year
2001           2                  50           2                  50
2002           3                  55           3                  55
2004           2                  65           2                  55

In [52]:
pd.merge(check2,check1, on='Year',how='outer')    #combined both DataFrame

      Int_rate_x  US_GDP_thousands_x  Int_rate_y  US_GDP_thousands_y
Year
2001         2.0                50.0         2.0                50.0
2002         3.0                55.0         3.0                55.0
2004         2.0                65.0         2.0                55.0
2005         2.0                55.0         NaN                 NaN
2003         NaN                 NaN         2.0                65.0

<img src="http://www.codeproject.com/KB/database/Visual_SQL_joins/Visual_SQL_joins_orig.jpg"/>

In [54]:
pwd

'C:\\Users\\esrijyo\\python_prog'

In [2]:
employee= pd.read_excel('employee.xlsx')

In [3]:
employee.set_index('ID',inplace=True)

In [4]:
employee

         Name  Title_id  Years  Department_id
ID
2       Chris         1     15              2
6       Sandy         2      5              7
7   Christine         1      5              4
1       Aaron         3      3              3

In [6]:
employee.to_excel('to_excel.xlsx',sheet_name='newsheet')   #saving dataframe in a excel

In [78]:
title=pd.read_excel('titles.xlsx',sheet_name='Title')

In [80]:
title.set_index('ID',inplace=True)

In [81]:
title

               Name
ID
1         President
2     lead engineer
3            intern
4   Project Manager

In [82]:
employee.join(title,rsuffix='_title',lsuffix='_employee')

   Name_employee  Title_id  Years  Department_id     Name_title
ID
2          Chris         1     15              2  lead engineer
6          Sandy         2      5              7            NaN
7      Christine         1      5              4            NaN
1          Aaron         3      3              3      President

In [88]:

'''
Here it is matching left DataFrame to Right DataFrame with matching on "Title_id" with leftDataFrame
'''

employee_with_title=employee.join(title,rsuffix='_title',on='Title_id', lsuffix='_employee')

In [89]:
employee_with_title

   Name_employee  Title_id  Years  Department_id     Name_title
ID
2          Chris         1     15              2      President
6          Sandy         2      5              7  lead engineer
7      Christine         1      5              4      President
1          Aaron         3      3              3         intern

In [84]:
department=pd.read_excel('titles.xlsx',sheet_name='Deptt')

In [86]:
department.set_index('ID',inplace=True)

In [87]:
department

                 Name
ID
1               Sales
2             Product
3   Technical Support
4     Human resources

In [91]:
employee_with_title.join(department,on=['ID'],rsuffix='_deptt',lsuffix='_employee')

   Name_employee  Title_id  Years  Department_id     Name_title     Name
ID
2          Chris         1     15              2      President  Product
6          Sandy         2      5              7  lead engineer      NaN
7      Christine         1      5              4      President      NaN
1          Aaron         3      3              3         intern    Sales

In [95]:
employee_with_title.join(department, on=['Department_id'], rsuffix='_department')

,Name_employee,Title_id,Years,Department_id,Name_title,Name
ID,,,,,,
2,Chris,1,15,2,President,Product
6,Sandy,2,5,7,lead engineer,NaN
7,Christine,1,5,4,President,Human resources
1,Aaron,3,3,3,intern,Technical Support

In [96]:
employee_with_title.join(department, on=['Department_id'], rsuffix='_department', how='inner') #inner join or common in both

   Name_employee  Title_id  Years  Department_id Name_title               Name
ID
2          Chris         1     15              2  President            Product
7      Christine         1      5              4  President    Human resources
1          Aaron         3      3              3     intern  Technical Support

In [98]:
employee_with_title.join(department, on=['Department_id'],how='right', rsuffix='_department') #right outer join

,Name_employee,Title_id,Years,Department_id,Name_title,Name
2.0,Chris,1.0,15.0,2,President,Product
7.0,Christine,1.0,5.0,4,President,Human resources
1.0,Aaron,3.0,3.0,3,intern,Technical Support
NaN,NaN,NaN,NaN,1,NaN,Sales

In [2]:
operation_df=pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})

In [3]:
operation_df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
operation_df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## find unique numbers in a column of DataFrame

In [104]:
operation_df['col2'].unique()

array([444, 555, 666], dtype=int64)

## Find length of unique values in a dataFrame; Two ways to find, one is len() and other is nunique()

In [5]:
len(operation_df['col2'].unique())

3

In [6]:
operation_df['col2'].nunique()

3

In [7]:
operation_df['col2'].value_counts() #how many times values occured in dataset

444    2
555    1
666    1
Name: col2, dtype: int64

## to apply conditions in DataFrame ; We need to define function first or can be all together using "apply()" function

In [8]:
def times2(x):
    return x*2

In [10]:
operation_df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [11]:
operation_df['col3'].apply(len)    #it can only be applied on String as integer has no length

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [12]:
operation_df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [13]:
operation_df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [14]:
operation_df.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
operation_df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## To sort a column in DataFrame , use DataFrame.sort_values()

In [17]:
operation_df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [16]:
operation_df.sort_values(by='col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
operation_df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [19]:
operation_df.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [20]:
data_op={
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

In [22]:
df_op=pd.DataFrame(data_op)

In [23]:
df_op

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

## "pivot_table()" takes three main argument i.e. values,index and column

In [24]:
df_op.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [7]:
df_html=pd.read_html('https://www.fdic.gov/Bank/individual/failed/banklist.html')

In [10]:
df_html[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [12]:
fail_IN=pd.read_html('https://www.bankrate.com/banking/list-of-failed-banks/')

In [17]:
fail_IN[0]

,Year,Bank failure cost to DIF,Total number of bank failures: 509
0,2020 (estimated),$60.9 million,2
1,2019 (estimated),$36.2 million,4
2,2018 (estimated),$0,0
3,2017 (estimated),$1.307 billion,8
4,2016 (estimated),$9.6 million,5
5,2015 (estimated),$894 million,8
6,2014 (estimated),$398.8 million,18
7,2013 (estimated),$1.165 billion,24
8,2012 (estimated),$2.785 billion,51
9,2011 (official),$7.945 billion,92
10,2010 (official),$22.904 billion,157
11,2009 (official),$38.732 billion,140

In [20]:
result=0
for x in range(1,6):
    print(x)
    result+=x
print(result)

1
2
3
4
5
15

In [21]:
import pandas as pd

In [ ]:
result=